iota2/iota2-hub/iota2/i2_STM32F4xx_HAL_Driver/src/i2_stm32f4xx_hal_spi.c
/**
 * @author      iota square <i2>
 * @date        16-09-2019
 *  _       _        ___
 * (_)     | |      |__ \.
 *  _  ___ | |_ __ _   ) |
 * | |/ _ \| __/ _` | / /
 * | | (_) | || (_| |/ /_
 * |_|\___/ \__\__,_|____|
 *
 * @License     GNU GPU v3
 *
 * This program is free software; you can redistribute it and/or
 * modify it under the terms of the GNU General Public License
 * as published by the Free Software Foundation; either version 3
 * of the License, or (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * Free Software, Hell Yeah!
 *
 **/

/* Includes ------------------------------------------------------------------*/
#include "i2_stm32f4xx_hal_spi.h"


#if defined ( ENABLE_RTOS_AWARE_HAL )
#include <FreeRTOS.h>
#include <semphr.h>
#endif

#include "stm32f4xx_hal_conf.h"
#include "stm32f4xx_hal_gpio.h"
#include "stm32f4xx_hal_gpio_ex.h"

/* Private defines -----------------------------------------------------------*/
/* Definition for SPI Priority */
#define SPI_PREEMPTION_PRIORITY           ( 5 )
#define SPI_SUB_PRIORITY                  ( 1 )
#define SPI_DMA_PREEMPTION_PRIORITY       ( 5 )
#define SPI_DMA_SUB_PRIORITY              ( 1 )

/* iota2 SPI CONFIGURATION *****************************************************

  +=========+=======+=========+=====+=======+=======+===========+===========+
  | SPI     | PIN   | GPIO    | AF  | MODE  | DMA   | CHANNEL   | STREAM    |
  +=========+=======+=========+=====+=======+=======+===========+===========+
  | SPI1    | NSS   | PA4     | AF5 |       |       |           |           |
  |         |       | PA15    |     |       |       |           |           |
  |         +-------+---------+     |       |       |           |           |
  |         | SCLK  | PA5     |     |       |       |           |           |
  |         |       | PB3     |     |       |       |           |           |
  |         +-------+---------+     |       |       |           |           |
  |         | MISO  | PA6     |     |       |       |           |           |
  |         |       | PB4     |     |       |       |           |           |
  |         +-------+---------+     |       |       |           |           |
  |         | MOSI  | PA7     |     |       |       |           |           |
  |         |       | PB5     |     |       |       |           |           |
  |         +-------+---------+     +-------+-------+-----------+-----------+
  |         |       |         |     | RX    | DMA2  | CHANNEL3  | STREAM0   |
  |         |       |         |     |       |       |           | STREAM2   |
  |         +-------+---------+     +-------+       |           +-----------+
  |         |       |         |     | TX    |       |           | STREAM3   |
  |         |       |         |     |       |       |           | STREAM4   |
  +=========+=======+=========+=====+=======+=======+===========+===========+
  | SPI2    | NSS   | PB9     | AF5 |       |       |           |           |
  |         |       | PB12    |     |       |       |           |           |
  |         |       | PI0     |     |       |       |           |           |
  |         +-------+---------+     |       |       |           |           |
  |         | SCLK  | PB10    |     |       |       |           |           |
  |         |       | PB13    |     |       |       |           |           |
  |         |       | PI1     |     |       |       |           |           |
  |         +-------+---------+     |       |       |           |           |
  |         | MISO  | PC2     |     |       |       |           |           |
  |         |       | PB14    |     |       |       |           |           |
  |         |       | PI2     |     |       |       |           |           |
  |         +-------+---------+     |       |       |           |           |
  |         | MOSI  | PC3     |     |       |       |           |           |
  |         |       | PB15    |     |       |       |           |           |
  |         |       | PI3     |     |       |       |           |           |
  |         +-------+---------+     +-------+-------+-----------+-----------+
  |         |       |         |     | RX    | DMA1  | CHANNEL0  | STREAM3   |
  |         +-------+---------+     +-------+       |           +-----------+
  |         |       |         |     | TX    |       |           | STREAM4   |
  +=========+=======+=========+=====+=======+=======+===========+===========+
  | SPI3    | NSS   | PA4     | AF5 |       |       |           |           |
  |         |       | PA15    |     |       |       |           |           |
  |         +-------+---------+     |       |       |           |           |
  |         | SCLK  | PC10    |     |       |       |           |           |
  |         |       | PB3     |     |       |       |           |           |
  |         +-------+---------+     |       |       |           |           |
  |         | MISO  | PC11    |     |       |       |           |           |
  |         |       | PB4     |     |       |       |           |           |
  |         +-------+---------+     |       |       |           |           |
  |         | MOSI  | PC12    |     |       |       |           |           |
  |         |       | PB5     |     |       |       |           |           |
  |         +-------+---------+     +-------+-------+-----------+-----------+
  |         |       |         |     | RX    | DMA1  | CHANNEL0  | STREAM0   |
  |         |       |         |     |       |       |           | STREAM2   |
  |         +-------+---------+     +-------+       |           +-----------+
  |         |       |         |     | TX    |       |           | STREAM5   |
  |         |       |         |     |       |       |           | STREAM7   |
  +=========+=======+=========+=====+=======+=======+===========+===========+

*******************************************************************************/

/* Defined Number of UART Modules to Enable ***********************************/
#define I2_MAX_NUM_SPI_CONTEXT            ( 3 )
#define I2_ENABLE_SPI1_CONTEXT
#define I2_ENABLE_SPI2_CONTEXT
#define I2_ENABLE_SPI3_CONTEXT

/* SPI1 CONFIGURATION SELECTION ***********************************************/
/* Definition for SPI1 Pins, to be defined as < PORT, PIN > */
#define SPI1_SCLK_GPIO_CONFIG               GPIOB, GPIO_PIN_3
#define SPI1_MISO_GPIO_CONFIG               GPIOB, GPIO_PIN_4
#define SPI1_MOSI_GPIO_CONFIG               GPIOB, GPIO_PIN_5
/* Definition for SPI1 DMA, to be defined as < CHANNEL, STREAM > */
#define SPI1_RX_DMA_CONFIG                  DMA_CHANNEL_3, DMA2_Stream2
#define SPI1_TX_DMA_CONFIG                  DMA_CHANNEL_3, DMA2_Stream3
/* Definition for SPI1 NVIC */
#define SPI1_DMA_RX_IRQn                    DMA2_Stream2_IRQn
#define SPI1_DMA_TX_IRQn                    DMA2_Stream3_IRQn
#define SPI1_DMA_RX_IRQHandler              DMA2_Stream2_IRQHandler
#define SPI1_DMA_TX_IRQHandler              DMA2_Stream3_IRQHandler
/******************************************************************************/

/* SPI2 CONFIGURATION SELECTION ***********************************************/
/* Definition for SPI2 Pins, to be defined as < PORT, PIN > */
#define SPI2_SCLK_GPIO_CONFIG               GPIOI, GPIO_PIN_1
#define SPI2_MISO_GPIO_CONFIG               GPIOI, GPIO_PIN_2
#define SPI2_MOSI_GPIO_CONFIG               GPIOI, GPIO_PIN_3
/* Definition for SPI2 DMA, to be defined as < CHANNEL, STREAM > */
#define SPI2_RX_DMA_CONFIG                  DMA_CHANNEL_0, DMA1_Stream3
#define SPI2_TX_DMA_CONFIG                  DMA_CHANNEL_0, DMA1_Stream4
/* Definition for SPI2 NVIC */
#define SPI2_DMA_RX_IRQn                    DMA1_Stream3_IRQn
#define SPI2_DMA_TX_IRQn                    DMA1_Stream4_IRQn
#define SPI2_DMA_RX_IRQHandler              DMA1_Stream3_IRQHandler
#define SPI2_DMA_TX_IRQHandler              DMA1_Stream4_IRQHandler
/******************************************************************************/

/* SPI3 CONFIGURATION SELECTION ***********************************************/
/* Definition for SPI3 Pins, to be defined as < PORT, PIN > */
#define SPI3_SCLK_GPIO_CONFIG               GPIOC, GPIO_PIN_10
#define SPI3_MISO_GPIO_CONFIG               GPIOC, GPIO_PIN_11
#define SPI3_MOSI_GPIO_CONFIG               GPIOC, GPIO_PIN_12
/* Definition for SPI3 DMA, to be defined as < CHANNEL, STREAM > */
#define SPI3_RX_DMA_CONFIG                  DMA_CHANNEL_0, DMA1_Stream2
#define SPI3_TX_DMA_CONFIG                  DMA_CHANNEL_0, DMA1_Stream7
/* Definition for SPI3 NVIC */
#define SPI3_DMA_RX_IRQn                    DMA1_Stream2_IRQn
#define SPI3_DMA_TX_IRQn                    DMA1_Stream7_IRQn
#define SPI3_DMA_RX_IRQHandler              DMA1_Stream2_IRQHandler
#define SPI3_DMA_TX_IRQHandler              DMA1_Stream7_IRQHandler
/******************************************************************************/

