iota2/iota2-hub/iota2/i2_STM32F4xx_HAL_Driver/src/i2_stm32f4xx_hal_spi.c
/*
 * This defines the attributes of spi hardware controller. Note that
 * a spi hardware controller can be shared by many spi device instances
 * with different chip select gpio. The details of the controller attributes
 * are statically defined in the spi.c. We do not have any need to dynamically
 * configure them yet nor do we want to do that as they might be shared.
 */
typedef struct {
  const char*           ctx_name;
  i2_gpio_inst_t        SCLK;
  i2_gpio_inst_t        MISO;
  i2_gpio_inst_t        MOSI;
  int32_t               hal_mode;
  bool                  initialized;
  SPI_TypeDef*          baseaddr;
  uint32_t              dma_rx_channel;
  DMA_Stream_TypeDef*   dma_rx_stream;
  uint32_t              dma_rx_priority;
  IRQn_Type             dma_rx_irqn;
  uint32_t              dma_tx_channel;
  DMA_Stream_TypeDef*   dma_tx_stream;
  uint32_t              dma_tx_priority;
  IRQn_Type             dma_tx_irqn;
  SPI_HandleTypeDef     spi;
  DMA_HandleTypeDef     hdma_rx;
  DMA_HandleTypeDef     hdma_tx;
 #if defined ( ENABLE_RTOS_AWARE_HAL)
  SemaphoreHandle_t     mutex;
  SemaphoreHandle_t     sem;
#endif /* ENABLE_RTOS_AWARE_HAL */
  __IO ITStatus         status;
} i2_spi_ctx_t;

static i2_spi_ctx_t i2_spi_ctx_table[I2_MAX_NUM_SPI_CONTEXT] = {
#if defined ( I2_ENABLE_SPI1_CONTEXT )
  {
    "SPI1",
    { "spi1_sclk", SPI1_SCLK_GPIO_CONFIG },
    { "spi1_miso", SPI1_MISO_GPIO_CONFIG },
    { "spi1_mosi", SPI1_MOSI_GPIO_CONFIG },
    DMA_MODE, false, SPI1,
    SPI1_RX_DMA_CONFIG, DMA_PRIORITY_HIGH,     SPI1_DMA_RX_IRQn,
    SPI1_TX_DMA_CONFIG, DMA_PRIORITY_MEDIUM,   SPI1_DMA_TX_IRQn,
  },
#endif /* I2_ENABLE_SPI1_CONTEXT */
#if defined ( I2_ENABLE_SPI2_CONTEXT )
  {
    "SPI2",
    { "spi2_sclk", SPI2_SCLK_GPIO_CONFIG },
    { "spi2_miso", SPI2_MISO_GPIO_CONFIG },
    { "spi2_mosi", SPI2_MOSI_GPIO_CONFIG },
    DMA_MODE, false, SPI2,
    SPI2_RX_DMA_CONFIG, DMA_PRIORITY_HIGH,     SPI2_DMA_RX_IRQn,
    SPI2_TX_DMA_CONFIG, DMA_PRIORITY_MEDIUM,   SPI2_DMA_TX_IRQn,
  },
#endif /* I2_ENABLE_SPI2_CONTEXT */
#if defined ( I2_ENABLE_SPI3_CONTEXT )
  {
    "SPI3",
    { "spi3_sclk", SPI3_SCLK_GPIO_CONFIG },
    { "spi3_miso", SPI3_MISO_GPIO_CONFIG },
    { "spi3_mosi", SPI3_MOSI_GPIO_CONFIG },
    DMA_MODE, false, SPI3,
    SPI3_RX_DMA_CONFIG, DMA_PRIORITY_HIGH,     SPI3_DMA_RX_IRQn,
    SPI3_TX_DMA_CONFIG, DMA_PRIORITY_MEDIUM,   SPI3_DMA_TX_IRQn,
  },
#endif /* I2_ENABLE_SPI3_CONTEXT */
};

/*
 * We can have more number of SPI device instances
 * than the number of SPI controllers
 */
#define I2_MAX_NUM_SPI_INSTANCE    (3)
static i2_spi_inst_t *i2_spi_inst_table[I2_MAX_NUM_SPI_INSTANCE];

#if defined ( I2_ENABLE_SPI1_CONTEXT )
static SPI_HandleTypeDef *spi1 = NULL;
#endif /* I2_ENABLE_SPI1_CONTEXT */
#if defined ( I2_ENABLE_SPI2_CONTEXT )
static SPI_HandleTypeDef *spi2 = NULL;
#endif /* I2_ENABLE_SPI2_CONTEXT */
#if defined ( I2_ENABLE_SPI3_CONTEXT )
static SPI_HandleTypeDef *spi3 = NULL;
#endif /* I2_ENABLE_SPI3_CONTEXT */

static i2_spi_ctx_t* spi_inst_to_ctx(const char *name)
{
  int32_t i;

  for (i = 0; i < I2_MAX_NUM_SPI_CONTEXT; i++) {
    if (!strcmp(i2_spi_ctx_table[i].ctx_name, name)) {
      return &i2_spi_ctx_table[i];
    }
  }
  return NULL;
}

static i2_spi_ctx_t* spi_handle_to_ctx(SPI_HandleTypeDef *hspi)
{
  int32_t i;

  for (i = 0; i < I2_MAX_NUM_SPI_CONTEXT; i++) {
    if (&i2_spi_ctx_table[i].spi == hspi) {
      return &i2_spi_ctx_table[i];
    }
  }
  return NULL;
}

i2_error i2_spi_init(i2_spi_inst_t *inst)
{
  i2_error retval = I2_SUCCESS;
  i2_spi_ctx_t *ctx;
  SPI_HandleTypeDef *hspi;
  SPI_TypeDef *base;
  IRQn_Type irqn;
  int32_t i;
  uint32_t alt;

  if ( !inst ) {
    return I2_INVALID_PARAM;
  }

  /* get SPI context from name */
  ctx = spi_inst_to_ctx(inst->ctx_name);
  if ( !ctx ) {
    return I2_INVALID_PARAM;
  }

#if defined ( ENABLE_RTOS_AWARE_HAL )
  /* Create mutexes. */
  ctx->mutex = xSemaphoreCreateMutex();

  /* Create semaphores */
  ctx->sem = xSemaphoreCreateBinary();
#endif /* ENABLE_RTOS_AWARE_HAL */

  /* SPI driver needs GPIO */
  i2_gpio_init();

  /* Configure CS */
  if (i2_gpio_is_valid(&inst->CS)) {
    i2_gpio_config_out(&inst->CS, true);
  }

  /*
   * If context has been already initialized,
   * only init SPI device instance specific portions.
   */
  if ( ctx->initialized ) {
    for (i = 0; i < I2_MAX_NUM_SPI_INSTANCE; i++) {
      if (!i2_spi_inst_table[i]) {
        i2_spi_inst_table[i] = inst;
        break;
      }
    }
    return I2_SUCCESS;
  }

  /* Get the pointer to the SPI handle */
  hspi = &(ctx->spi);

  /* Get the SPI controller base address */
  base = ctx->baseaddr;

  ctx->status = I2_TRANSFER_DONE;

  if ( base == SPI1 ) {
    spi1 = hspi;
    irqn = SPI1_IRQn;
    alt = GPIO_AF5_SPI1;
    __HAL_RCC_SPI1_CLK_ENABLE();
    if ( ctx->hal_mode == DMA_MODE ) {
      __HAL_RCC_DMA2_CLK_ENABLE();
    }
  } else if ( base == SPI2 ) {
    spi2 = hspi;
    irqn = SPI2_IRQn;
    alt = GPIO_AF5_SPI2;
    __HAL_RCC_SPI2_CLK_ENABLE();
    if ( ctx->hal_mode == DMA_MODE ) {
      __HAL_RCC_DMA1_CLK_ENABLE();
    }
  } else if ( base == SPI3 ) {
    spi3 = hspi;
    irqn = SPI3_IRQn;
    alt = GPIO_AF6_SPI3;
    __HAL_RCC_SPI3_CLK_ENABLE();
    if ( ctx->hal_mode == DMA_MODE ) {
      __HAL_RCC_DMA1_CLK_ENABLE();
    }
  } else {
    return I2_INVALID_PARAM;
  }

  /* Configure SCLK */
  if ( i2_gpio_is_valid(&ctx->SCLK) ) {
    i2_gpio_config_alt(&ctx->SCLK, GPIO_MODE_AF_PP, GPIO_PULLDOWN, alt);
  }

  /* Configure MISO */
  if ( i2_gpio_is_valid(&ctx->MISO) ) {
    i2_gpio_config_alt(&ctx->MISO, GPIO_MODE_AF_PP, GPIO_PULLDOWN, alt);
  }

  /* Configure MOSI */
  if ( i2_gpio_is_valid(&ctx->MOSI) ) {
    i2_gpio_config_alt(&ctx->MOSI, GPIO_MODE_AF_PP, GPIO_PULLDOWN, alt);
  }

  /* DMA RX Config */
  if ( ctx->hal_mode == DMA_MODE) {
  /*##### Configure the DMA streams ##########################################*/
    /* Configure the DMA handler for Transmission process */
    ctx->hdma_rx.Instance                 = ctx->dma_rx_stream;
    ctx->hdma_rx.Init.Channel             = ctx->dma_rx_channel;
    ctx->hdma_rx.Init.Direction           = DMA_PERIPH_TO_MEMORY;
    ctx->hdma_rx.Init.PeriphInc           = DMA_PINC_DISABLE;
    ctx->hdma_rx.Init.MemInc              = DMA_MINC_ENABLE;
    ctx->hdma_rx.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
    ctx->hdma_rx.Init.MemDataAlignment    = DMA_MDATAALIGN_BYTE;
    ctx->hdma_rx.Init.Mode                = DMA_NORMAL;
    ctx->hdma_rx.Init.Priority            = ctx->dma_rx_priority;
    ctx->hdma_rx.Init.FIFOMode            = DMA_FIFOMODE_DISABLE;
    ctx->hdma_rx.Init.FIFOThreshold       = DMA_FIFO_THRESHOLD_FULL;
    ctx->hdma_rx.Init.MemBurst            = DMA_MBURST_SINGLE;
    ctx->hdma_rx.Init.PeriphBurst         = DMA_MBURST_SINGLE;

