iota2/iota2-hub/iota2/i2_STM32F4xx_HAL_Driver/src/i2_stm32f4xx_hal_spi.c
    HAL_DMA_Init(&ctx->hdma_rx);

    /* Associate the initialized DMA handle to the the SPI handle */
    __HAL_LINKDMA(hspi, hdmarx, ctx->hdma_rx);

      /* Configure the DMA handler for Transmission process */
    ctx->hdma_tx.Instance                 = ctx->dma_tx_stream;
    ctx->hdma_tx.Init.Channel             = ctx->dma_tx_channel;
    ctx->hdma_tx.Init.Direction           = DMA_MEMORY_TO_PERIPH;
    ctx->hdma_tx.Init.PeriphInc           = DMA_PINC_DISABLE;
    ctx->hdma_tx.Init.MemInc              = DMA_MINC_ENABLE;
    ctx->hdma_tx.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
    ctx->hdma_tx.Init.MemDataAlignment    = DMA_MDATAALIGN_BYTE;
    ctx->hdma_tx.Init.Mode                = DMA_NORMAL;
    ctx->hdma_tx.Init.Priority            = ctx->dma_tx_priority;
    ctx->hdma_tx.Init.FIFOMode            = DMA_FIFOMODE_DISABLE;
    ctx->hdma_tx.Init.FIFOThreshold       = DMA_FIFO_THRESHOLD_FULL;
    ctx->hdma_tx.Init.MemBurst            = DMA_MBURST_SINGLE;
    ctx->hdma_tx.Init.PeriphBurst         = DMA_MBURST_SINGLE;

    HAL_DMA_Init(&ctx->hdma_tx);

    /* Associate the initialized DMA handle to the the SPI handle */
    __HAL_LINKDMA(hspi, hdmatx, ctx->hdma_tx);

    /*##### Configure the NVIC for DMA #########################################*/
    /* NVIC configuration for DMA transfer complete interrupt */
    HAL_NVIC_SetPriority( ctx->dma_rx_irqn, SPI_DMA_PREEMPTION_PRIORITY,
                          SPI_DMA_SUB_PRIORITY);
    HAL_NVIC_EnableIRQ(ctx->dma_rx_irqn);

    /* NVIC configuration for DMA transfer complete interrupt */
    HAL_NVIC_SetPriority( ctx->dma_tx_irqn,
                          SPI_DMA_PREEMPTION_PRIORITY, SPI_DMA_SUB_PRIORITY);
    HAL_NVIC_EnableIRQ(ctx->dma_tx_irqn);
  }

  HAL_NVIC_SetPriority(irqn, SPI_PREEMPTION_PRIORITY, SPI_SUB_PRIORITY);
  HAL_NVIC_EnableIRQ(irqn);


  /*##### Configure the SPI peripheral #######################################*/
  /* Set the SPI parameters */
  hspi->Instance                  = base;
  /* Clock speed defaults to 20MHZ (80Mhz / 4) */
  hspi->Init.BaudRatePrescaler    = SPI_BAUDRATEPRESCALER_4;
  hspi->Init.Direction            = SPI_DIRECTION_2LINES;
  /* Default to SPI_MODE_0 */
  hspi->Init.CLKPhase             = SPI_PHASE_1EDGE;
  hspi->Init.CLKPolarity          = SPI_POLARITY_LOW;
  /* Data width defaults to 8bit */
  hspi->Init.DataSize             = SPI_DATASIZE_8BIT;
  /* Bit shift starts with the highest bit of the data unit by default */
  hspi->Init.FirstBit             = SPI_FIRSTBIT_MSB;
  hspi->Init.TIMode               = SPI_TIMODE_DISABLE;
  hspi->Init.CRCCalculation       = SPI_CRCCALCULATION_DISABLE;
  hspi->Init.CRCPolynomial        = 7;
  hspi->Init.NSS                  = SPI_NSS_SOFT;
  hspi->Init.Mode                 = SPI_MODE_MASTER;

  if ( HAL_SPI_Init(hspi) != HAL_OK ) {
    retval = I2_FAILURE;
  } else {
    for (i = 0; i < I2_MAX_NUM_SPI_INSTANCE; i++) {
      if ( !i2_spi_inst_table[i] ) {
        i2_spi_inst_table[i] = inst;
        break;
      }
    }
  }

  ctx->initialized = true;

  return retval;
}

i2_error i2_spi_deinit(i2_spi_inst_t *inst)
{
  i2_spi_ctx_t *ctx;
  SPI_TypeDef *base;

  if ( !inst ) {
    return I2_INVALID_PARAM;
  }

  /* get SPI context from name */
  ctx = spi_inst_to_ctx(inst->ctx_name);
  if ( !ctx ) {
    return I2_INVALID_PARAM;
  }

#if defined ( ENABLE_RTOS_AWARE_HAL )
  /* Delete mutexes. */
  vSemaphoreDelete( ctx->mutex );

  /* Delete semaphores */
  vSemaphoreDelete(ctx->sem);
#endif /* ENABLE_RTOS_AWARE_HAL */

  base = ctx->baseaddr;
  /*##### Reset peripherals and Disable NVIC #################################*/
  if ( base == SPI1 ) {
    __HAL_RCC_SPI1_FORCE_RESET();
    __HAL_RCC_SPI1_RELEASE_RESET();
    HAL_NVIC_DisableIRQ(SPI1_DMA_RX_IRQn);
    HAL_NVIC_DisableIRQ(SPI1_DMA_TX_IRQn);
    HAL_NVIC_DisableIRQ(SPI1_IRQn);
  } else if ( base == SPI2 ) {
    __HAL_RCC_SPI2_FORCE_RESET();
    __HAL_RCC_SPI2_RELEASE_RESET();
    HAL_NVIC_DisableIRQ(SPI2_DMA_RX_IRQn);
    HAL_NVIC_DisableIRQ(SPI2_DMA_TX_IRQn);
    HAL_NVIC_DisableIRQ(SPI2_IRQn);
  } else if ( base == SPI3 ) {
    __HAL_RCC_SPI3_FORCE_RESET();
    __HAL_RCC_SPI3_RELEASE_RESET();
    HAL_NVIC_DisableIRQ(SPI3_DMA_RX_IRQn);
    HAL_NVIC_DisableIRQ(SPI3_DMA_TX_IRQn);
    HAL_NVIC_DisableIRQ(SPI3_IRQn);
  } else {
    return I2_NOT_AVAILABLE;
  }

  /*##### Disable peripherals and GPIO Clocks ################################*/
  i2_gpio_release(&ctx->SCLK);
  i2_gpio_release(&ctx->MISO);
  i2_gpio_release(&ctx->MOSI);

  /*##### Disable the DMA Streams ############################################*/
  HAL_DMA_DeInit(&ctx->hdma_tx);
  HAL_DMA_DeInit(&ctx->hdma_rx);

  return I2_SUCCESS;
}

i2_spi_inst_t* i2_spi_inst_get(char *inst_name)
{
  int32_t i;

  for (i = 0; i < I2_MAX_NUM_SPI_INSTANCE; i++) {
    if ( !strcmp(i2_spi_inst_table[i]->inst_name, inst_name) ) {
      return i2_spi_inst_table[i];
    }
  }

  return NULL;
}

static i2_error spi_config(i2_spi_ctx_t *ctx, i2_spi_data_width_t data_width,
                           i2_spi_clock_speed_t clk_speed,
                           i2_spi_mode_t spi_mode, i2_spi_first_bit_t first_bit)
{
  i2_error retval = I2_SUCCESS;
  SPI_HandleTypeDef *hspi;
  uint32_t prescaler;

  if ( !ctx ) {
    return I2_INVALID_PARAM;
  }

  /* SPI controller needs to be initialized first */
  if ( !ctx->initialized ) {
    return I2_FAILURE;
  }

  /* Get the pointer to the SPI hspi */
  hspi = &(ctx->spi);

  /* Set the SPI mode */
  switch ( spi_mode ) {
  case I2_SPI_MODE_0 :
    hspi->Init.CLKPhase = SPI_PHASE_1EDGE;
    hspi->Init.CLKPolarity = SPI_POLARITY_LOW;
    break;
  case I2_SPI_MODE_1 :
    hspi->Init.CLKPhase = SPI_PHASE_2EDGE;
    hspi->Init.CLKPolarity = SPI_POLARITY_LOW;
    break;
  case I2_SPI_MODE_2 :
    hspi->Init.CLKPhase = SPI_PHASE_1EDGE;
    hspi->Init.CLKPolarity = SPI_POLARITY_HIGH;
    break;
  case I2_SPI_MODE_3 :
    hspi->Init.CLKPhase = SPI_PHASE_2EDGE;
    hspi->Init.CLKPolarity = SPI_POLARITY_HIGH;
    break;
  default:
    return I2_INVALID_PARAM;
  }

  /* Set the SPI clock */
  switch ( clk_speed ) {
  case I2_SPI_CLK_40_MHZ:
    prescaler = SPI_BAUDRATEPRESCALER_2;
    break;
  case I2_SPI_CLK_20_MHZ:
    prescaler = SPI_BAUDRATEPRESCALER_4;
    break;
  case I2_SPI_CLK_10_MHZ:
    prescaler = SPI_BAUDRATEPRESCALER_8;
    break;
  case I2_SPI_CLK_5_MHZ:
    prescaler = SPI_BAUDRATEPRESCALER_16;
    break;
  case I2_SPI_CLK_2500_KHZ:
    prescaler = SPI_BAUDRATEPRESCALER_32;
    break;
  case I2_SPI_CLK_1250_KHZ:
    prescaler = SPI_BAUDRATEPRESCALER_64;
    break;
  case I2_SPI_CLK_625_KHZ:
    prescaler = SPI_BAUDRATEPRESCALER_128;
    break;
  case I2_SPI_CLK_313_KHZ:
    prescaler = SPI_BAUDRATEPRESCALER_256;
    break;
  default:
    return I2_INVALID_PARAM;
  }
  hspi->Init.BaudRatePrescaler = prescaler;

