iota2/iota2-hub/iota2/i2_STM32F4xx_HAL_Driver/src/i2_stm32f4xx_hal_spi.c
  /* Set the SPI data width */
  switch ( data_width ) {
  case I2_SPI_DATA_WIDTH_8BIT:
    hspi->Init.DataSize = SPI_DATASIZE_8BIT;
    break;
  case I2_SPI_DATA_WIDTH_16BIT:
    hspi->Init.DataSize = SPI_DATASIZE_16BIT;
    break;
  default:
    return I2_INVALID_PARAM;
  }

  /* Set first bit shift order */
  switch ( first_bit ) {
  case I2_SPI_MSBIT_FIRST:
    hspi->Init.FirstBit = SPI_FIRSTBIT_MSB;
    break;
  case I2_SPI_LSBIT_FIRST:
    hspi->Init.FirstBit = SPI_FIRSTBIT_LSB;
    break;
  default:
    return I2_INVALID_PARAM;
  }

  /* This will re-init the SPI controller */
  if ( HAL_SPI_Init(hspi) != HAL_OK ) {
    retval = I2_FAILURE;
  }

  return retval;
}

i2_error i2_spi_txrx_raw( i2_spi_inst_t *inst, i2_spi_data_width_t data_width,
                          i2_spi_clock_speed_t clk_speed,
                          i2_spi_mode_t spi_mode, i2_spi_first_bit_t first_bit,
                          uint8_t *txbuf, uint8_t *rxbuf,
                          int32_t size, uint32_t timeout)
{
  i2_error err = I2_FAILURE;
  HAL_StatusTypeDef retval;
  i2_spi_ctx_t *ctx;

  if ( !inst ) {
    return I2_INVALID_PARAM;
  }

  ctx = spi_inst_to_ctx(inst->ctx_name);
  if ( !ctx ) {
    return I2_INVALID_PARAM;
  }

  err = spi_config(ctx, data_width, clk_speed, spi_mode, first_bit);
  if ( err != I2_SUCCESS ) {
    return err;
  }

  if ( ctx->hal_mode != POLLING_MODE ) {
    ctx->status = I2_TRANSFER_WAIT;
  }

  if (ctx->hal_mode == INTERRUPT_MODE) {
    if ( !rxbuf ) {
      retval = HAL_SPI_Transmit_IT(&ctx->spi, txbuf, size);
    } else if ( !txbuf ) {
      retval = HAL_SPI_Receive_IT(&ctx->spi, rxbuf, size);
    } else {
      retval = HAL_SPI_TransmitReceive_IT(&ctx->spi, txbuf, rxbuf, size);
    }
  } else if (ctx->hal_mode == DMA_MODE) {
    if ( !rxbuf ) {
      retval = HAL_SPI_Transmit_DMA(&ctx->spi, txbuf, size);
    } else if ( !txbuf ) {
      retval = HAL_SPI_Receive_DMA(&ctx->spi, rxbuf, size);
    } else {
      retval = HAL_SPI_TransmitReceive_DMA(&ctx->spi, txbuf, rxbuf, size);
    }
    return I2_NOT_IMPLEMENTED;
  } else {
    retval = HAL_SPI_TransmitReceive(&ctx->spi, txbuf, rxbuf, size,
                                      (TickType_t) timeout);
  }

  if ( ctx->hal_mode != POLLING_MODE ) {
#if defined ( ENABLE_RTOS_AWARE_HAL )
    if (xSemaphoreTake(ctx->sem, (TickType_t)timeout) == pdFALSE) {
      retval = HAL_TIMEOUT;
    }
#else
    while (ctx->status == I2_TRANSFER_WAIT);
#endif /* ENABLE_RTOS_AWARE_HAL */
  }

  err = i2_get_hal_error(retval);

  /* Check for error interrupt */
  if ( ctx->status == I2_TRANSFER_ERROR ) {
    err = I2_FAILURE;
  } else if ( ctx->status == I2_TRANSFER_WAIT ) {
    /* Complete interrupt was not received */
    err = I2_TIMEOUT;
  }  else if ( txbuf && ctx->spi.TxXferCount ) {
    /* Check if the tx xfer is done */
    err = I2_FAILURE;
  } else if ( rxbuf && ctx->spi.RxXferCount ) {
    /* Check if the rx xfer is done */
    err = I2_FAILURE;
  }

  return err;
}

i2_error i2_spi_txrx( i2_spi_inst_t *inst, i2_spi_data_width_t data_width,
                      i2_spi_clock_speed_t clk_speed,
                      i2_spi_mode_t spi_mode, i2_spi_first_bit_t first_bit,
                      uint8_t *txbuf, uint8_t *rxbuf,
                      int32_t size, uint32_t timeout)
{
  i2_error err = I2_FAILURE;
  i2_spi_ctx_t *ctx;

  if ( !inst ) {
    return I2_INVALID_PARAM;
  }

  ctx = spi_inst_to_ctx(inst->ctx_name);
  if ( !ctx ) {
    return I2_INVALID_PARAM;
  }

#if defined ( ENABLE_RTOS_AWARE_HAL )
  if (xSemaphoreTake(ctx->mutex, (TickType_t)timeout) == pdFALSE) {
    return I2_TIMEOUT;
  }
#endif /* ENABLE_RTOS_AWARE_HAL*/

  /* assert CS */
  if ( i2_gpio_is_valid(&inst->CS) ) {
    i2_gpio_set(&inst->CS, false);
  }

  err = i2_spi_txrx_raw(inst, data_width, clk_speed, spi_mode,
                        first_bit, txbuf, rxbuf, size, timeout);

  /* deassert CS */
  i2_gpio_set(&inst->CS, true);

#if defined ( ENABLE_RTOS_AWARE_HAL )
  xSemaphoreGive(ctx->mutex);
#endif /* ENABLE_RTOS_AWARE_HAL */

  return err;
}

i2_error i2_spi_tx( i2_spi_inst_t *inst,  i2_spi_data_width_t data_width,
                    i2_spi_clock_speed_t clk_speed,
                    i2_spi_mode_t spi_mode, i2_spi_first_bit_t first_bit,
                    uint8_t *txbuf, int32_t size, uint32_t timeout)
{
  return i2_spi_txrx( inst, data_width, clk_speed, spi_mode,
                      first_bit, txbuf, NULL, size, timeout);
}

i2_error i2_spi_tx_raw( i2_spi_inst_t *inst,  i2_spi_data_width_t data_width,
                        i2_spi_clock_speed_t clk_speed,
                        i2_spi_mode_t spi_mode, i2_spi_first_bit_t first_bit,
                        uint8_t *txbuf, int32_t size, uint32_t timeout)
{
  return i2_spi_txrx_raw( inst, data_width, clk_speed, spi_mode,
                          first_bit, txbuf, NULL, size, timeout);
}

i2_error i2_spi_rx( i2_spi_inst_t *inst,  i2_spi_data_width_t data_width,
                    i2_spi_clock_speed_t clk_speed,
                    i2_spi_mode_t spi_mode, i2_spi_first_bit_t first_bit,
                    uint8_t *rxbuf, int32_t size, uint32_t timeout)
{
  return i2_spi_txrx( inst, data_width, clk_speed, spi_mode,
                      first_bit, NULL, rxbuf, size, timeout);
}

i2_error i2_spi_rx_raw( i2_spi_inst_t *inst,  i2_spi_data_width_t data_width,
                        i2_spi_clock_speed_t clk_speed,
                        i2_spi_mode_t spi_mode, i2_spi_first_bit_t first_bit,
                        uint8_t *rxbuf, int32_t size, uint32_t timeout)
{
  return i2_spi_txrx_raw( inst, data_width, clk_speed, spi_mode,
                          first_bit, NULL, rxbuf, size, timeout);
}

i2_error i2_spi_cs_assert(i2_spi_inst_t *inst, uint32_t timeout)
{
  i2_spi_ctx_t *ctx;

  if ( !inst ) {
    return I2_INVALID_PARAM;
  }

  ctx = spi_inst_to_ctx(inst->ctx_name);
  if ( !ctx ) {
    return I2_INVALID_PARAM;
  }

#if defined ( ENABLE_RTOS_AWARE_HAL )
  if (xSemaphoreTake(ctx->mutex, (TickType_t)timeout) == pdFALSE) {
    return I2_TIMEOUT;
  }
#endif /* ENABLE_RTOS_AWARE_HAL */

