iota2/iota2-hub/iota2/i2_STM32F4xx_HAL_Driver/src/i2_stm32f4xx_hal_spi.c
  /* assert CS */
  if ( i2_gpio_is_valid(&inst->CS) ) {
    i2_gpio_set(&inst->CS, false);
  }

  return I2_SUCCESS;
}

i2_error i2_spi_cs_deassert(i2_spi_inst_t *inst)
{
  i2_spi_ctx_t *ctx;

  if ( !inst ) {
    return I2_INVALID_PARAM;
  }

  ctx = spi_inst_to_ctx(inst->ctx_name);
  if ( !ctx ) {
    return I2_INVALID_PARAM;
  }

  /* deassert CS */
  if ( i2_gpio_is_valid(&inst->CS) ) {
    i2_gpio_set(&inst->CS, true);
  }

#if defined ( ENABLE_RTOS_AWARE_HAL )
  xSemaphoreGive(ctx->mutex);
#endif /* ENABLE_RTOS_AWARE_HAL */

  return I2_SUCCESS;
}

#if defined ( I2_ENABLE_SPI1_CONTEXT )
void SPI1_IRQHandler(void)
{
  HAL_SPI_IRQHandler(spi1);
}

void SPI1_DMA_RX_IRQHandler(void)
{
  HAL_DMA_IRQHandler(spi1->hdmarx);
}

void SPI1_DMA_TX_IRQHandler(void)
{
  HAL_DMA_IRQHandler(spi1->hdmatx);
}
#endif /* I2_ENABLE_SPI1_CONTEXT */

#if defined ( I2_ENABLE_SPI2_CONTEXT )
void SPI2_IRQHandler(void)
{
  HAL_SPI_IRQHandler(spi2);
}

void SPI2_DMA_RX_IRQHandler(void)
{
  HAL_DMA_IRQHandler(spi2->hdmarx);
}

void SPI2_DMA_TX_IRQHandler(void)
{
  HAL_DMA_IRQHandler(spi2->hdmatx);
}
#endif /* I2_ENABLE_SPI2_CONTEXT */

#if defined ( I2_ENABLE_SPI3_CONTEXT )
void SPI3_IRQHandler(void)
{
  HAL_SPI_IRQHandler(spi3);
}

void SPI3_DMA_RX_IRQHandler(void)
{
  HAL_DMA_IRQHandler(spi3->hdmarx);
}

void SPI3_DMA_TX_IRQHandler(void)
{
  HAL_DMA_IRQHandler(spi3->hdmatx);
}
#endif /* I2_ENABLE_SPI3_CONTEXT */

static void spi_cplt_callback(SPI_HandleTypeDef *hspi)
{
#if defined ( ENABLE_RTOS_AWARE_HAL )
  static BaseType_t xHigherPriorityTaskWoken;
#endif /* ENABLE_RTOS_AWARE_HAL */
  i2_spi_ctx_t *ctx = spi_handle_to_ctx(hspi);

  if (ctx) {
#if defined ( ENABLE_RTOS_AWARE_HAL )
    xSemaphoreGiveFromISR(ctx->sem, &xHigherPriorityTaskWoken);
    portYIELD_FROM_ISR(xHigherPriorityTaskWoken);
#endif /* ENABLE_RTOS_AWARE_HAL */
    ctx->status = I2_TRANSFER_DONE;
  }
}

void HAL_SPI_TxRxCpltCallback(SPI_HandleTypeDef *hspi)
{
  spi_cplt_callback(hspi);
}

void HAL_SPI_TxCpltCallback(SPI_HandleTypeDef *hspi)
{
  spi_cplt_callback(hspi);
}

void HAL_SPI_RxCpltCallback(SPI_HandleTypeDef *hspi)
{
  spi_cplt_callback(hspi);
}

void HAL_SPI_ErrorCallback(SPI_HandleTypeDef *hspi)
{
#if defined ( ENABLE_RTOS_AWARE_HAL )
  static BaseType_t xHigherPriorityTaskWoken;
#endif /* ENABLE_RTOS_AWARE_HAL */
  i2_spi_ctx_t *ctx = spi_handle_to_ctx(hspi);

  if ( ctx ) {
#if defined ( ENABLE_RTOS_AWARE_HAL )
    xSemaphoreGiveFromISR(ctx->sem, &xHigherPriorityTaskWoken);
    portYIELD_FROM_ISR(xHigherPriorityTaskWoken);
#endif /* ENABLE_RTOS_AWARE_HAL */
    ctx->status = I2_TRANSFER_ERROR;
  }
}

/************************ (C) COPYRIGHT iota2 ************END OF FILE**********/
